Repository: Jobava/desedilizare-gnome
Catalog: gnome-extras.ui.*.2015-08-18/blam.master.*.po
Languages: ro

source: Blam Feed Reader
ro: Cititor de fluxuri Blam

source: Feed reader
ro: Cititor de fluxuri

source: State of the main window
ro: Starea ferestrei principale

source: The state of the main window, valid values are 'normal' and 'maximized'.
ro: Starea ferestrei principale, valorile valide fiind „normal” și „maximized”.

source: Width of the main window
ro: Lățimea ferestrei principale

source: The width of the main window.
ro: Lățimea ferestrei principale.

source: Height of main window
ro: Înălțimea ferestrei principale

source: The height of the main window.
ro: Înălțimea ferestrei principale.

source: X position of main window
ro: Poziția X a ferestrei principale

source: The stored position of the main window, the X coordinate.
ro: Poziția stocată a ferestrei principale, coordonata X.

source: Y position of main window
ro: Poziția Y a ferestrei principale

source: The stored position of the main window, the Y coordinate.
ro: Poziția stocată a ferestrei principale, coordonata Y.

source: Width of channel list
ro: Lățimea listei de canale

source: The width of the channel list.
ro: Lățimea listei de canale.

source: Height of entry list
ro: Înălțimea listei de intrare

source: The height of the entry list.
ro: Înălțimea listei de intrări.

source: Current theme
ro: Tema curentă

source: The theme used to render the entries.
ro: Tema folosită pentru a reda intrările.

source: Reverse the entries in the entry list
ro: Inversează intrările din lista de intrări

source: Show the newest entries at the top of the entry list.
ro: Afișează noile intrări de la începutul listei de intrări.

source: Automatically refresh channels
ro: Reîmprospătează canalele automat

source: Automatically refresh all channels at a regular interval.
ro: Reîmprospătează automat toate canalele la un interval regulat.

source: Automatically refresh channels interval
ro: Interval de reîmprospătare automată a canalelor

source: The refresh rate for when to refresh all channels.
ro: Rata de reîmprospătare în cazul reîmprospătării tuturor canalelor.

source: Enter the URL of the new channel
ro: Introduceți URL-ul canalului nou

source: Username
ro: Nume utilizator

source: Password
ro: Parolă

source: Blam News Reader
ro: Cititorul de știri Blam

source: _Mark as unread
ro: _Marchează ca necitit

source: _Mark as read
ro: _Marchează ca citit

source: File {0} already exists
ro: Fișierul {0} există deja

source: Do you want to overwrite the file?
ro: Doriți să suprascrieți fișierul?

source: _Overwrite
ro: _Suprascrie

source: Export to...
ro: Exportă către...

source: Cancel
ro: Anulează

source: Save
ro: Salvează

source: Refreshing: {0}
ro: Se reîmprospătează: {0}

source: Next update at {0}
ro: Următoarea actualizare va avea loc la {0}

source: _File
ro: _Fișier

source: _Import OPML
ro: _Importă OPML

source: _Export OPML
ro: _Exportă OPML

source: _Edit
ro: _Editează

source: _Channel
ro: _Canal

source: Create a new group
ro: Creează un grup nou

source: Add _Group
ro: Adaugă _grup

source: _Mark as Read
ro: _Marchează ca citit

source: Refresh _All
ro: Reîmprospătează _toate

source: Mark All as _Read
ro: Marchează toate ca _citite

source: E_ntry
ro: I_ntrare

source: _Edit keywords
ro: _Editează cuvintele cheie

source: _Next unread
ro: Următorul _necitit

source: _Help
ro: _Ajutor

source: Channels ({0} unread)
ro: Canale ({0} necitite)

source: _Refresh All
ro: _Reîmprospătează toate

source: Edit channel
ro: Editează canalul

source: Change the fields to update channel information
ro: Modifică câmpurile pentru a actualiza informațiile canalului

source: Name:
ro: Nume:

source: Keywords:
ro: Cuvinte cheie:

source: Remove Channel?
ro: Eliminați canalul?

source: _Remove
ro: _Elimină

source: Add a new channel
ro: Adaugă un canal nou

source: Preferences
ro: Preferințe

source: _Newest entries at the top
ro: _Cele mai noi intrări la început

source: _Automatically refresh all channels every
ro: Reîmprospătează _automat toate canalele la un interval de

source: minutes
ro: minute

source: _Ignore SSL certificate check errors
ro: _Ignoră erorile de verificare ale certificatului SSL

source: Refresh feeds on startup
ro: Reîmprospătează fluxurile la pornire

source: Theme
ro: Temă

source: _Mark items read after
ro: _Marchează elementele pentru a fi citite

source: seconds
ro: secunde

source: Import OPML Feed
ro: Importă fluxul OPML

source: Enter the URL or filename for the OPML file
ro: Introduceți URL-ul sau numele fișierului OPML

source: _Select file
ro: _Selectează fișierul

source: _Import
ro: _Importă

source: Importing OPML file
ro: Se importă fișierul OPML

source: Importing channels
ro: Se importă canalele

source: Themes
ro: Teme

source: Set Theme
ro: Setează tema

source: Error
ro: Eroare

source: About Blam
ro: Despre Blam

source: Create new group
ro: Creează grup nou

source: Name:
ro: Nume:

source: _Refresh
ro: _Reîmprospătează

source: Remo_ve
ro: _Elimină

source: Do you want to remove the channel or group {0} from the channel list?
ro: Doriți să ștergeți canalul sau grupul {0} din lista canalelor?

source: by {0}
ro: de {0}

source: Show in browser
ro: Afișează în navigator

source: Select OPML file
ro: Alegeți fișierul OPML

source: Open
ro: Deschide

source: Imported {0} channels from OPML file
ro: S-au importat {0} canale din fișierul OPML

source: Failed to import {0}
ro: Importarea a eșuat {0}

source: Not a valid OPML file
ro: Fișierul OPML nu este valid

source: File not found
ro: Nu s-a găsit fișierul

source: Invalid file name
ro: Numele fișierului nu este valid

source: Could not find OPML file
ro: Nu s-a găsit fișierul OPML

source: Unknown error
ro: Eroare necunoscută

source: Opening OPML file
ro: Se deschide fișierul OPML

source: {0} unread item
ro: {0} element necitit

source: ({0} new)
ro: ({0} nou)
