Repository: Jobava/desedilizare-gnome
Catalog: gnome-infrastructure.ui.*.2015-08-18/gnome314.master.*.po
Languages: ro

source: Thanks to the hard work of our contributors..
ro: Mulțumită muncii asidue din partea contribuitorilor noștri..

source: ..and thanks to the friends of GNOME
ro: ..și mulțumită prietenilor GNOME

source: ..we're proud to announce GNOME 3.14.
ro: ..suntem mândri să anunțăm GNOME 3.14.

source: With this release GNOME brings an improved desktop..
ro: Cu această lansare GNOME aduce un mediu de birou îmbunătățit..

source: ..for its users and developers.
ro: ..pentru utilizatorii și dezvoltatorii săi.

source: The visual details in GNOME have been revised..
ro: Detaliile vizuale în GNOME au fost revizuite..

source: ..and new animations have been implemented..
ro: ..și animații noi au fost implementate..

source: ..to improve your user experience.
ro: ..pentru a îmbunătăți experiența dumneavoastră ca utilizator.

source: This release also brings better support for multitouch.
ro: Această versiune aduce suport mai bun pentru atingere tactilă multiplă.

source: You can now use swipe and zoom..
ro: Acum puteți utiliza swipe și zoom..

source: ..in a multitude of GNOME apps.
ro: ..într-o multitudine de aplicații GNOME.

source: GNOME Shell also has new gestures.
ro: GNOME Shell are, de asemenea, gesturi noi.

source: For example, when switching workspaces..
ro: De exemplu, la schimbarea spațiilor de lucru..

source: ..and opening the activities overview.
ro: ..și deschiderea panoramei de activități.

source: With help from GNOME's community..
ro: Cu ajutor din partea comunității GNOME..

source: ..and from this year's internship participants..
ro: ..și a stagiarilor din acest an..

source: ..a lot of the GNOME apps have received updates.
ro: ..o mulțime de aplicații GNOME au fost actualizate.

source: Software now supports app add-ons.
ro: Programe suportă acum suplimente ale aplicațiilor.

source: Maps gained navigation routing.
ro: Hărți beneficiază de rutare de navigare.

source: Photos can import your photos from Google.
ro: Fotografii poate importa forografiile dumneavoastră de la Google.

source: And Weather's interface was redesigned.
ro: Vremea are o nouă interfață reproiectată.

source: Furthermore, clocks and calculator have new search providers..
ro: Mai mult, Ceasuri și Calculator au noi furnizori de căutare..

source: ..so you can check the time..
ro: ..pentru a putea verifica ora..

source: ..and calculate live in the search field.
ro: ..și efectua calcule în timp real în câmpul de căutare.

source: Sudoku and mines were redesigned..
ro: Sudoku și Mine au fost reproiectate..

source: ..for a better gameplay experience.
ro: ..pentru o mai bună experiență de joc.

source: And a new game, named Hitori..
ro: Și un joc nou, intitulat Hitori..

source: ..is now a part of GNOME games.
ro: ..face acum parte din jocurile GNOME.

source: With GNOME 3.14, developers can look forward to..
ro: Cu GNOME 3.14, dezvoltatorii se pot aștepta..

source: ..a better development environment.
ro: ..la un mediu de dezvoltare mai bun.

source: GTK has begun an ongoing effort..
ro: GTK a demarat un efort continuu..

source: ..to improve the developer experience.
ro: ..de a îmbunătăți experiența de dezvoltare.

source: This release ships with GTK Inspector..
ro: Această versiune vine cu GTK Inspector..

source: an interactive debugger aimed to improve your debugging workflow.
ro: un depanator interactiv ce are ca scop îmbunătățirea procesului de depanare.

source: GTK also comes with more documentation..
ro: GTK vine de asemenea cu mai multă documentație..

source: ..including a brand new set of human interface guidelines.
ro: ..inclusiv cu un nou set de reguli orientative pentru interfața umană.

source: Apart from the news for GTK..
ro: În afara noutăților privind GTK..

source: ..this release brings more stability..
ro: ..această versiune este mai stabilă..

source: ..to the GNOME compositor in Wayland.
ro: ..pentru compozitorul GNOME în Wayland.

source: Furthermore, glib has gained new features..
ro: Mai mult, glib beneficiază de noi funcționalități..

source: ..like Unicode 7 compliance..
ro: ..precum conformitate cu standardul Unicode 7..

source: ..and support for the new Mimeapps spec.
ro: ..și suport pentru noile specificații Mimeapps.

source: Many distributions will ship GNOME 3.14 in the future.
ro: Multe distribuții vor furniza GNOME 3.14 în viitor.

source: If you can't wait..
ro: Dacă nu puteți aștepta..

source: Try out our demo image in the description.
ro: Încercați imaginea demo din descriere.

source: Or come join us in making our next GNOME release even better.
ro: Sau alăturați-vă nouă pentru a creea o nouă versiune GNOME și mai bună.

source: We look forward to getting you started.
ro: Suntem nerăbdători să începeți.
