Repository: Jobava/desedilizare-gnome
Catalog: gnome-infrastructure.ui.*.2015-08-18/library-web.master.*.po
Languages: ro

source: GMime is a powerful MIME (Multipurpose Internet Mail Extension) utility library. It is meant for creating, editing, and parsing MIME messages and structures.
ro: GMime este o bibliotecă puternică pe nume MIME (Multipurpose Internet Mail Extension). Este folosită pentru crearea, editarea și analizarea mesajelor și structurilor MIME.

source: Tracker is a tool designed to extract information and metadata about user's personal data so that it can be searched easily and quickly. The libtracker-common library is the foundation for common procedures used in the daemon and the indexer.
ro: Tracker este o unealtă făcută să extragă informația și metadatele despre datele personale ale utilizatorului, astfel încât acestea să poată fi găsite cu ușurință. Biblioteca libtracker stă la baza tuturor procedurilor comune folosite în serviciu și în indicii.

source: Tracker is a tool designed to extract information and metadata about user's personal data so that it can be searched easily and quickly. The libtracker-module library helps developers write third party modules to extract content not commonly supported by Tracker.
ro: Tracker este o unealtă făcută să extragă informația și metadatele despre datele personale ale utilizatorului, astfel încât acestea să poată fi găsite cu ușurință. Biblioteca libtracker-module ajută dezvoltatorii să scrie module externe de extragere a conținutului care nu este în mod normal suportat de Tracker.

source: Release Notes
ro: Note de lansare

source: GNOME has a time-based release schedule. This means that there is a new GNOME release with accompanying notes every six months, to the minute.
ro: GNOME are un orar de lansări bazat pe timp. Asta înseamnă că la fiecare 6 luni apare câte o nouă versiune acompaniată de note de lansare.
