Repository: Jobava/desedilizare-gnome
Catalog: gnome-infrastructure.ui.*.2015-08-18/library-web.master.*.po
Languages: ro

source: GNOME Documentation Library
ro: Biblioteca GNOME pentru documentație

source: Home
ro: Acasă

source: Users
ro: Utilizatori

source: About
ro: Despre

source: Even though it's extremely user-friendly, GNOME is a large and complex system, and thus, requires some learning to use to the fullest. To make that easier, we've provided some very useful documentation.
ro: Chiar dacă este ușor de utilizat, GNOME este un sistem vast și complex, și, prin urmare, este necesară o oarecare documentație pentru a-l putea utiliza la maximum. Pentru a face acest lucru mai ușor, vă furnizăm o documentație foarte utilă.

source: Developers
ro: Dezvoltatori

source: Administrators
ro: Administratori

source: Across the world, there are many large to small deployments of GNOME, with their specific needs, and system administrators to manage them. Here you will find information on tools and methods to work with many GNOME desktops.
ro: În întreaga lume există instalări mari și mici de GNOME, cu nevoi specifice și administratori de sistem pentru a le gestiona. Aici veți găsi informații despre uneltele și metodele de lucru pentru multe desktopuri GNOME.

source: Available Languages:
ro: Limbi disponibile:

source: Available Versions:
ro: Versiuni disponibile:

source: White Papers
ro: Foi albe

source: Guides
ro: Ghid

source: Development Guides
ro: Ghiduri de dezvoltare

source: Manuals
ro: Manuale

source: Tutorials
ro: Ghid practic

source: Frequently Asked Questions
ro: Întrebări frecvente

source: Others
ro: Altele

source: Overview
ro: Prezentarea generală a platformei

source: Tools
ro: Unelte

source: GNOME Documentation Project
ro: Proiectul de documentație GNOME

source: There is no translation of this documentation for your language; the documentation in its original language is displayed instead.
ro: Acestă documentație nu este disponibilă în limba dumneavoastră; se va afișa documentația în limba originală.

source: see other translations for this documentation
ro: vezi alte traduceri pentru această documentație

source: development version
ro: versiunea de dezvoltare

source: Search
ro: Căutare

source: Lookup Symbol
ro: Căutare simbol

source: documentation on development version
ro: documentație pentru versiunea de dezvoltare

source: See also:
ro: Vezi de asemenea:

source: This module is heading towards planned deprecation. It will continue to be supported and API/ABI stable throughout the GNOME 2.x series, but we do not recommend using it in new applications unless you require functionality that has not already been moved elsewhere.
ro: Acest modul va fi în curând învechit. Deși va fi suportat în continuare și va fi stabil API/ABI în versiunile următoare ale seriei GNOME 2.X, nu se recomandă folosirea lui în aplicații noi, decât dacă aveți nevoie de o funcție care nu a fost mutată deja în altă parte.

source: Standards
ro: Standarde

source: Language Bindings
ro: Asocieri de limbaj

source: Preferred language is loaded from a cookie.
ro: Limba selectată este încărcată dintr-un cookie

source: Unable to display document in preferred language loaded from cookie, as translation probably does not exist.
ro: Nu se poate afișa acest document din limba încarcată din cookie, fiind probabil ca aceasta nici nu există.

source: Remove cookie
ro: Șterge cookie

source: Downloads
ro: Descărcari

source: Note the API references are usually available as packages in the distributions and visible via the Devhelp tool.
ro: Notă! Referințele API sunt de obicei disponibile sub formă de pachete în distribuții și sunt vizibile prin utilitarul DevHelp.

source: external resource
ro: resurse externe

source: News
ro: Știri

source: Projects
ro: Proiecte

source: Art
ro: Artă

source: Support
ro: Suport

source: Development
ro: Dezvoltare

source: Community
ro: Comunitate

source: Same documents, formatted as a single HTML file
ro: Aceleași documente, formatate într-un singur fișier HTML.

source: Nightly
ro: Noapte de noapte

source: External Tools and Resources
ro: Unelte și resurse externe

source: GLib provides the core application building blocks for libraries and applications written in C. It provides the core object system used in GNOME, the main loop implementation, and a large set of utility functions for strings and common data structures.
ro: GLib furnizează funcționalitatea de bază pentru construirea bibliotecilor și a aplicațiilor în C. GLib oferă un sistem de obiecte de bază folosit în GNOME, implementarea ciclului principal și o gamă largă de funcții utile pentru șiruri și structuri date obișnuite.

source: GObject provides the object system used for Pango and GTK+.
ro: GObject furnizează sistemul obiecte folosit pentru Pango și GTK+.

source: GIO provides a modern and easy-to-use VFS API. It provides a file system abstraction which allows applications to access local and remote files with a single consistent API.
ro: GIO furnizează un API VFS modern și ușor de folosit. Furnizează o abstractizare a sistemului de fișiere ce oferă aplicațiilor acces la fișiere locale sau din rețea printr-un un singur API consecvent.

source: The AT-SPI library provides interfaces which are used by accessibility technologies.
ro: Biblioteca AT-SPI furnizează interfețe care sunt utilizate de tehnologiile de accesibilitate.

source: GAIL provides an implementation of the ATK interfaces for GTK+ and GNOME libraries, allowing accessibility tools to interact with applications written using these libraries.
ro: GAIL furnizează o implementare a interfețelor ATK pentru bibliotecile GTK+ și GNOME, astfel reușindu-se o interacțiune între uneltele de accesibilitate și alte aplicații scrise folosind aceste biblioteci.

source: Pango is the core text and font handling library used in GNOME applications. It has extensive support for the different writing systems used throughout the world.
ro: Pango este biblioteca de bază pentru fonturi și text folosită în aplicațiile GNOME. Beneficiază de un suport extensiv pentru varietatea de sisteme de scriere din întreaga lume.

source: GdkPixbuf is a library for image loading and manipulation. The GdkPixbuf documentation contains both the programmer's guide and the API reference.
ro: GdkPixbuf este o bibliotecă pentru manipularea și încărcarea imaginilor. Documentația GdkPixbuf conține atât ghidul programatorului cât și referința pentru API.

source: An intermediate layer which isolates GTK+ from the details of the windowing system.
ro: Un strat intermediar ce izolează GTK+ de detaliile sistemului de ferestre.

source: GTK+ is the primary library used to construct user interfaces in GNOME applications. It provides user interface controls and signal callbacks to control user interfaces.
ro: GTK+ este biblioteca principală folosită pentru construcția interfețelor utilizator în aplicațiile GNOME. Furnizează controale și semnale callback pentru controlul interfeței de utilizator.

source: libxml2 Reference Manual
ro: Manual libxml2

source: Powerful and feature complete XML handling library.
ro: Bibliotecă puternică și completă pentru XML.

source: libxslt Reference Manual
ro: Manual de referință libxslt

source: The XSLT C library developed for the Gnome project. XSLT itself is a an XML language to define transformation for XML. Libxslt is based on libxml2.
ro: Biblioteca C, XSLT, dezvoltată pentru proiectul Gnome. XSLT în sine este un limbaj de definire a transformărilor XML. Libxslt este bazată pe libxml2.

source: Libglade is a library for constructing user interfaces dynamically from XML descriptions. Libglade allow programmers to construct their user interfaces using a graphical interface builder application, and then import those interface definitions.
ro: Libglade este o bibliotecă pentru construcția interfețelor dinamice din descrierile XML. Libglade permite programatorilor să construiască propriile interfețe utilizator folosind o aplicație pentru construcția interfețelor, iar după să importe aceste definiții de interfețe.

source: The libgnome library provides a number of useful routines for building modern applications, including session management, activation of files and URIs, and displaying help.
ro: Biblioteca libgnome furnizează un număr de rutine folositoare în construcția aplicațiilor moderne, incluzând aici management de sesiune, activare a fișierelor și URI-urilor și afișare de ajutor.

source: The libgnomeui library provides additional widgets for applications. Many of the widgets from libgnomeui have already been ported to GTK+.
ro: Biblioteca libgnomeui furnizează suplimentar widgeturi pentru aplicații. Multe dintre aceste widgeturi au fost deja portate în GTK+.

source: GnomeVFS is the core library used to access files and folders in GNOME applications. It provides a file system abstraction which allows applications to access local and remote files with a single consistent API.
ro: GnomeVFS este biblioteca de bază folosită pentru accesarea fișierelor și dosarelor în aplicațiile GNOME. Furnizează o abstractizare a sistemului de fișiere ce permite aplicațiilor să acceseze fișierelor locale și din rețea cu un singur API.

source: GConf provides the daemon and libraries for storing and retrieving configuration data.
ro: GConf furnizează biblioteci și serviciul de stocare și obținere a datelor de configurare.

source: The GnomeCanvas widget provides a flexible widget for creating interactive structured graphics.
ro: Widgetul GnomeCanvas furnizează o unealtă flexibilă pentru crearea graficii interactive și structurate.

source: libart Reference Manual
ro: Manual de referință libart

source: Libart functions - Libart handles the drawing capabilities in GNOME. All complex rendering is handled here.
ro: Funcțiile limbart - Libart se ocupă de capabilitățile de desen în GNOME. Toate randările complexe sunt prelucrate aici.

source: ORBit is a fast and lightweight CORBA server. GNOME's component architecture, Bonobo, is built on top of CORBA.
ro: ORBit este un server CORBA rapid și ușor. Componenta de arhitectură a GNOME, Bonobo, este construită peste CORBA.

source: Bonobo-activation allows you to browse the available CORBA servers on your system (running or not). It keeps track of the running servers so that if you ask for a server which is already running, you will not start it again but will reuse the already running one.
ro: Bonobo-activation permite navigarea prin sistem după servere CORBA (pornite sau nu). Ține evidența serverelor și dacă se încercă rularea unui server de 2 ori, el nu se va deschide din nou, ci îl va refolosi pe cel care rulează deja.

source: Bonobo is a framework for creating reusable components for use in GNOME applications, built on top of CORBA.
ro: Bonobo este o platformă folosită pentru crearea componentelor reutilizabile în aplicațiile GNOME, construită peste CORBA.

source: The Bonobo UI library provides a number of user interface controls using the Bonobo component framework.
ro: Biblioteca de interfață Bonobo furnizează un număr de controale pentru interfață folosind platforma de componente Bonobo.

source: Library for rendering of SVG vector graphics.
ro: Bibliotecă pentru randarea graficii vectoriale SVG.

source: Terminal emulator widget used by GNOME terminal.
ro: Widget pentru emulatorul de terminal folosit de terminalul GNOME.

source: libsoup is an HTTP client/server library for GNOME. It uses GObjects and the glib main loop, to integrate well with GNOME applications.
ro: Biblioteca libsoup este un server/client pentru GNOME. Se folosește de GObject și de principalul ciclu al glib pentru a se integra bine cu aplicațiile în GNOME.

source: A library used for programming panel applets for the GNOME panel.
ro: O bibliotecă utilizată pentru programarea mini-aplicațiilor pentru panoul GNOME.

source: Structured File Library (GSF) is an I/O abstraction for reading/writing compound files.
ro: Biblioteca de fișiere structurată (GFS) este o abstracție de intrare/ieșire pentru citirea scrierea fișierelor compuse.

source: Cairo is a 2D graphics library with support for multiple output devices. It is designed to produce consistent output on all output media while taking advantage of display hardware acceleration when available.
ro: Cairo este o bibliotecă pentru grafică 2D care suportă multiple dispozitive de ieșire. Este proiectat să producă rezultate consecvente pe toate porturile de ieșire media, folosindu-se de accelerare hardware atunci când este disponibilă.

source: Clutter is a GObject based library for creating fast, visually rich, graphical user interfaces.
ro: Clutter este o bibliotecă GObject pentru crearea rapidă a interfețelor grafice bogate vizual.

source: COGL is a low level OpenGL abstraction library developed for (and part of) Clutter. It is used primarily by Clutter to provide a common rendering API that works transparently across OpenGL >=1.4, OpenGL ES 1.1 and OpenGL ES 2.0.
ro: COGL este o bibliotecă OpenGL de abstractizare de nivel scăzut dezvoltată pentru (și componentă a) bibliotecii Clutter. Este folosită în principal de Clutter pentru a furniza un API de randare comun care funcționează transparent peste OpenGL >=1.4, OpenGL ES 1.1 și OpenGL ES 2.0.

source: Libchamplain is a C library providing a ClutterActor to display maps.
ro: Libchamplain este o bibliotecă C care furnizează un ClutterActor pentru afișarea hărților.

source: Libchamplain-gtk is a C library on top of libchamplain providing a Gtk+ widget to display maps in GTK+ applications.
ro: Libchamplain-gtk este o bibliotecă C construită peste libchamplain care furnizează un widget Gtk+ pentru afișarea hărților în aplicațiile GTK+.

source: libcanberra is an implementation of the XDG Sound Theme and Name Specifications, for generating event sounds on free desktops,
ro: libcanberra este o implementare a Specificației XDG pentru teme de sunet și nume, pentru generarea efectelor sonore pe desktopuri libere,

source: libnotify is a library that sends desktop notifications to a notification daemon, as defined in the Desktop Notifications spec. These notifications can be used to inform the user about an event or display some form of information without getting in the user's way.
ro: libnotify este o bibliotecă care trimite notificări desktop unui serviciu de notificare, așa cum este definit în Specificația pentru notificări desktop. Aceste notificări pot fi folosite pentru a informa utilizatorul despre anumite evenimente sau pentru afișarea diferitelor informații fără a deranja utilizatorul din folosirea calculatorului.

source: D-Bus is a message bus system, a simple way for applications to talk to one another.
ro: D-Bus este un sistem de mesagerie, un mecanism simplu prin care aplicațiile comunică între ele.

source: Unique is a library for writing single-instance applications. If you launch a single-instance application twice, the second instance will either just quit or will send a message to the running instance. Unique makes it easy to write this kind of application by providing a base class, taking care of all the IPC machinery needed to send messages to a running instance, and also handling startup notification.
ro: Unique este o bibliotecă folosită pentru scrierea aplicațiilor cu o singură instanță. Dacă executați o astfel de aplicație de două ori, a doua instanță fie va afișa un mesaj sau pur și simplu nu va rula. Unique facilitează scrierea acestor tipuri de aplicații furnizând o clasă de bază care are grijă de toate mecanismele IPC necesare trimiteri de mesaje către instanța care se află în execuție și, de asemenea, are grijă și de notificările de pornire.

source: The GNOME Devtools Library package provides a docking system and several utilities useful to GNOME development tools and GNOME applications in general.
ro: Pachetul bibliotecii DevTools GNOME furnizează un sistem de andocare și alte câteva utilități folositoare uneltelor de dezvoltare GNOME și aplicațiilor în general.

source: GStreamer Core Reference Manual
ro: Manualul de referință pentru componenta de bază GStreamer

source: Powerful framework for creating multimedia applications. Supports both Audio and Video.
ro: Platformă puternică pentru crearea aplicațiilor multimedia. Suportă atât audio cât și video.

source: GStreamer Library Reference Manual
ro: Manualul de referință pentru biblioteca GStreamer

source: GStreamer Core Plugins Reference Manual
ro: Manualul de referință GStreamer pentru modulele de extensie de bază

source: GtkGLExt is an OpenGL extension to GTK+. It provides additional GDK objects which support OpenGL rendering in GTK+ and GtkWidget API add-ons to make GTK+ widgets OpenGL-capable.
ro: GtkGLExt este o extensie GTK+ a OpenGL. Furnizează obiecte GDK adiționale care suportă randare OpenGL în GTK+ și module GTKWidget API pentru a crea widgeturi GTK+ capabile OpenGL.

source: libpeas is a gobject-based plugins engine, and is targetted at giving every application the chance to assume its own extensibility.
ro: libpeas este un motor pentru module de extensie bazate pe GObject și este menit să dea oricărei aplicații șansa de a își asuma extensibilitatea.

source: dconf is a low-level configuration system. Its main purpose is to provide a backend to GSettings on platforms that don't already have configuration storage systems.
ro: dconf este un sistem de configurare de nivel jos. Principalul scop al acestuia este să furnizeze suport pentru Gsettings pe platformele care nu au încă sisteme de stocare a configurărilor.

source: telepathy-glib Reference Manual
ro: Manual de referință telepathy-glib.

source: GTK+ 2.0 Tutorial
ro: Ghid practic GTK+ 2.0

source: GTK+ FAQ
ro: Întrebări frecvente legate de GTK+

source: PyGTK Reference Manual
ro: Manual de referință PyGTK

source: PyGObject Reference Manual
ro: Manual de referință PyGObject

source: libsigc++ Documentation
ro: Documentație libsigc++

source: libxml++ Documentation
ro: Documentație libxml++

source: glibmm Documentation
ro: Documentație glibmm

source: gtkmm Documentation
ro: Documentație gtkmm

source: pangomm Documentation
ro: Documentație pangomm

source: atkmm Documentation
ro: Documentație atkmm

source: gconfmm Documentation
ro: Documentație gconfmm

source: libvtemm Documentation
ro: Documentație libvtemm

source: librsvgmm Documentation
ro: Documentație librsvgmm

source: libgdamm Documentation
ro: Documentație libgdamm

source: libgda-uimm Documentation
ro: Documentație libgda-uimm

source: gstreamermm Documentation
ro: Documentație gstreamermm

source: goocanvasmm Documentation
ro: Documentație goocanvasmm

source: gtkglextmm Documentation
ro: Documentație gtkglextmm

source: cluttermm Documentation
ro: Documentație cluttermm

source: clutter-gtkmm Documentation
ro: Documentație clutter-gtkmm

source: clutter-box2dmm Documentation
ro: Documentație clutter-box2dmm

source: libsigc++ Tutorial
ro: Ghid practic libsigc++

source: libxml++ Tutorial
ro: Ghid practic libxml++

source: java-gnome API Documentation
ro: Documentație API java-gnome

source: Java Interfaces for GTK+, GNOME and related libraries
ro: Interfețe Java pentru GTK+ și alte biblioteci GNOME

source: Vala API References
ro: Referințe API Vala

source: Vala API References for GTK+, GNOME and related libraries
ro: Referințe API Vala pentru GTK+, GNOME și alte biblioteci asemănătoare

source: GTK+ Programming Tutorial
ro: Ghid practic de programare cu GTK+

source: This GTK+ tutorial is written for the C programming language. It is suitable for beginners and intermediate programmers.
ro: Ghidul practic GTK+ este scris în limbajul de programare C. Este folositor începătorilor și programatorilor intermediari.

source: Desktop Entry Specification
ro: Specificații pentru intrările desktop

source: The Desktop Entries provide information about an application such as the name, icon, and description. These files are used for application launchers and for creating menus of applications that can be launched.
ro: Intrările Desktop furnizează informații despre o aplicație, cum ar fi numele, iconița și descrierea. Aceste fișiere sunt folosite pentru lansatoarele de aplicații și pentru crearea meniurilor de aplicații care pot fi lansate.

source: Menu Specification
ro: Specificație meniu

source: This freedesktop.org specification describes how menus are built up from desktop entries.
ro: Această specificație freedesktop.org descrie cum pot meniurile sa fie construite pe baza intrărilor desktop.

source: XDG Base Directory Specification
ro: Specificația pentru dosare de bază XDG

source: Various specifications specify files and file formats. This freedesktop.org specification defines where these files should be looked for by defining one or more base directories relative to which files should be located.
ro: Diverse specificații despre fișiere și formate de fișiere. Această specificație freedesktop.org definește unde se pot găsi de obicei aceste fișiere, definind unul sau mai multe dosare de bază, fișierele fiind localizate relativ față de acestea.

source: Icon Theme Specification
ro: Specificație teme iconițe

source: This freedesktop.org specification describes a common way to store icon themes.
ro: Această specificație freedesktop.org descrie un mod comun de a stoca temele de iconițe.

source: Icon Naming Specification
ro: Specificație denumire iconițe

source: This freedesktop.org specification describes a common way to name icons and their contexts in an icon theme.
ro: Această specificație freedesktop.org descrie un mod comun de denumire a iconițelor și a contextelor lor într-o temă de iconițe.

source: Desktop Application Autostart Specification
ro: Specificație autostart a aplicațiilor de tip desktop

source: This freedesktop.org specification describes how applications can be started automatically after the user has logged in and how media can request a specific application to be executed or a specific file on the media to be opened after the media has been mounted.
ro: Această specificație freedesktop.org descrie cum pot aplicațiile să fie rulate automat în momentul în care utilizatorul intră în sesiune și felul în care mediile de stocare pot cere unei aplicații să se execute sau unui anumit tip de fișier de pe mediul de stocare să fie deschis după ce mediul a fost montat.

source: Desktop Notifications Specification
ro: Specificații pentru notificările de pe desktop

source: This specification standardizes the interface to desktop notification services.
ro: Această specificație freedesktop.org standardizează interfața către serviciile de notificare desktop.

source: Extended Window Manager Hints
ro: Sugestii extinse pentru administratorul de ferestre

source: This freedesktop.org specification standardizes extensions to the ICCCM between X desktops.
ro: Această specificație freedesktop.org standardizează extensiile la ICCCM între desktopurile X.

source: Shared MIME-info Database Specification
ro: Baza de date partajată de informații MIME

source: This freedesktop.org specification attempts to unify the MIME database systems currently in use by X desktop environments.
ro: Această specificație freedesktop.org încearcă să unească sistemele de baze de date MIME folosite în prezent de mediile de desktop X.

source: The Easy Publish and Consume library (libepc) provides an easy method to publish data using HTTPS, announce that information via DNS-SD, find that information and finally consume it.
ro: Biblioteca „Easy Publish and Consume” (libepc) furnizează o metodă simplă pentru publicarea datelor folosind HTTPS, anunțarea acesteia prin DNS-SD, găsirea și folosirea acesteia în final.

source: GNet is a network library, written in C, object-oriented, and built upon GLib.
ro: GNet este o bibliotecă de rețea, scrisă în C, orientată pe obiecte, construită pe baza GLib.
